from controllers.main_controller import validateFeatureInput, switchCase

def main():
    while True:
        print(f'''
            ------------------------------------- ỨNG DỤNG QUẢN LÍ HỌC SINH -----------------------------------------
            |    Mã chức năng     |    Tên chức năng                    |    Mô tả                                  |
            |---------------------|-------------------------------------|-------------------------------------------|
            |    01.              |    Thêm học sinh mới                |    <Thêm một học sinh mới vào danh sách>  |
            |---------------------|-------------------------------------|-------------------------------------------|
            |    02.              |    Hiển thị danh sách học sinh      |    <Hiển thị toàn bộ học sinh hiện có>    |
            |---------------------|-------------------------------------|-------------------------------------------|
            |    03.              |    Cập nhật thông tin học sinh      |    <Cập nhật thông tin hs theo ID>        |
            |---------------------|-------------------------------------|-------------------------------------------|
            |    04.              |    Xóa thông tin học sinh           |    <Xóa thông tin hs theo ID>             |
            |---------------------|-------------------------------------|-------------------------------------------|
            |    05.              |    Sắp xếp ds (điểm - giảm)         |    <Hiển thị ds theo chiều giảm dần>      |
            |---------------------|-------------------------------------|-------------------------------------------|
            |    06.              |    Sắp xếp ds (điểm - tăng)         |    <Hiển thị ds theo chiều tăng dần>      |
            |---------------------|-------------------------------------|-------------------------------------------|
            |    07.              |    Sắp xếp ds (tuổi - giảm)         |    <Hiển thị ds lọc tuổi giảm dần>        |
            |---------------------|-------------------------------------|-------------------------------------------|
            |    08.              |    Sắp xếp ds (tuổi - tăng)         |    <Hiển thị ds lọc tuổi giảm dần>        |
            |---------------------|-------------------------------------|-------------------------------------------|
            |    09.              |    Tìm kiếm hs theo tên             |    <Hiển thị ds lọc theo tên đã nhập>     |
            |---------------------|-------------------------------------|-------------------------------------------|
            |    00.              |    Thoát chương trình               |    <Dừng trương trình>                    |
            |_____________________|_____________________________________|___________________________________________|
            |                     |                    * Vui lòng nhập số tương ứng để có thể sử dụng các chức năng |
            |_____________________|_________________________________________________________________________________|
            |                     |                                               Bản quyền: Lỗ Thành Duy - duylt79 |
            |_____________________|_________________________________________________________________________________|
        ''')

        while True: 
            featureChoosen = input("\nChọn một chức năng để sử dụng: ")
            checkValidate = validateFeatureInput(featureChoosen)

            if checkValidate: break
            else: print(">>>>> Chức năng không hợp lệ, vui lòng chọn lại! <<<<<")

        featureChoosenNumber = int(featureChoosen)
        if (featureChoosenNumber == 0):
            break
        else: switchCase(featureChoosenNumber)
